Revit 2024 API
LoadCase.Number Property
 Returns unique load case number.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public int Number { get; set; }
Visual Basic
Public Property Number As Integer
	Get
	Set
Visual C++
public:
property int Number {
	int get ();
	void set (int value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: The given number is not unique.
See Also
LoadCase Class
Autodesk.Revit.DB.Structure Namespace